#+title: Advent of Code 2024 Day 1
#+property: header-args :tangle solution.rb

#+begin_src ruby :session day1
file = File.open("example.txt")
lines = file.readlines.map(&:chomp)
#+end_src

#+RESULTS:
| 3   4 | 4   3 | 2   5 | 1   3 | 3   9 | 3   3 |

#+begin_src ruby :session day1
split_lines = lines.map(&:split)
#+end_src

#+RESULTS:
| 3 | 4 |
| 4 | 3 |
| 2 | 5 |
| 1 | 3 |
| 3 | 9 |
| 3 | 3 |

#+begin_src ruby :session day1
left = split_lines.map(&:first)
#+end_src

#+RESULTS:
| 3 | 4 | 2 | 1 | 3 | 3 |

#+begin_src ruby :session day1
right = split_lines.map(&:last)
#+end_src

#+RESULTS:
| 4 | 3 | 5 | 3 | 9 | 3 |

#+begin_src ruby :session day1
distances = left.sort.zip(right.sort).map { |i| (i.first.to_i - i.last.to_i).abs }
#+end_src

#+RESULTS:
| 2 | 1 | 0 | 1 | 2 | 5 |

#+begin_src ruby :session day1
result = distances.sum
#+end_src

#+RESULTS:
: 11

#+begin_src ruby :results none :session day1
puts "Part 1: #{result}"
#+end_src

#+begin_src ruby :session day1
tally = right.tally
#+end_src

#+RESULTS:
| 4 | =>1 | 3 | =>3 | 5 | =>1 | 9 | =>1 |

#+begin_src ruby :session day1
scores = left.map { |i| i.to_i * (tally[i] || 0) }
#+end_src

#+RESULTS:
| 9 | 4 | 0 | 0 | 9 | 9 |

#+begin_src ruby :session day1
result2 = scores.sum
#+end_src

#+RESULTS:
: 31

#+begin_src ruby :results none :session day1
puts "Part 2: #{result2}"
#+end_src
